app/views/gossips/index.html.erb

                <strong> La liste de tous les potins </strong>
                <span class="badge badge-primary badge-pill"> <%= Gossip.all.length %></span>
---
SELECT "gossips".* FROM "gossips"


              <% Gossip.all.each_with_index do |gossip, index| %>
---
SELECT "gossips".* FROM "gossips"