app/controllers/gossips_controller.rb

SELECT  "gossips".* FROM "gossips" ORDER BY "gossips"."id" ASC LIMIT $1  [["LIMIT", 1]]
SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 201], ["LIMIT", 1]]
---
  def show
    offset = Gossip.first.id
    @gossip = Gossip.find((offset + :id.to_s.to_i).to_s)
    @gossips = Gossip.all

SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 301], ["LIMIT", 1]]
---
  def update
    @gossip = Gossip.find(:id.to_s)